#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil expand-links:t f:t
#+options: inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+options: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title: unzipper
#+date: 2024-08-12
#+author: Lenin G. Falconí
#+email: lenin.falconi@epn.edu.ec
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.1 (Org mode 9.7.5)
#+cite_export:

* Objectives
- To write some python code to unzip all files inside all folders
  inside a primary folder

#+begin_src python :session :results output :exports both
import os
import zipfile

directory = "/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython"

for subdirs in os.listdir(directory):
    print(subdirs)
    for file in os.listdir(os.path.join(directory, subdirs)):
        print(file)
        if file.endswith('.zip'):
            file_path = os.path.join(directory, subdirs, file)
            print(file_path)
            with zipfile.ZipFile(file_path, 'r') as zip_ref:
                zip_ref.extractall(os.path.join(directory, subdirs))
            print(f'Unzipped: {file_path}')
#+end_src

#+RESULTS:
#+begin_example
ALEXIS FERNANDO BAUTISTA MIÑO_10798346_assignsubmission_file_
proyectoPythonAreas.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/ALEXIS FERNANDO BAUTISTA MIÑO_10798346_assignsubmission_file_/proyectoPythonAreas.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/ALEXIS FERNANDO BAUTISTA MIÑO_10798346_assignsubmission_file_/proyectoPythonAreas.zip
ALEXIS SEBASTIAN VASCO TANDALLA_10798337_assignsubmission_file_
PythonProjectExample_VascoAlexis.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/ALEXIS SEBASTIAN VASCO TANDALLA_10798337_assignsubmission_file_/PythonProjectExample_VascoAlexis.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/ALEXIS SEBASTIAN VASCO TANDALLA_10798337_assignsubmission_file_/PythonProjectExample_VascoAlexis.zip
ALICIA DAYANA PEREIRA TUQUERES_10798370_assignsubmission_file_
PereiraAlicia_PythonProjectExample.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/ALICIA DAYANA PEREIRA TUQUERES_10798370_assignsubmission_file_/PereiraAlicia_PythonProjectExample.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/ALICIA DAYANA PEREIRA TUQUERES_10798370_assignsubmission_file_/PereiraAlicia_PythonProjectExample.zip
ANNDY JOSE RENGIFO LANDETA_10798325_assignsubmission_file_
Proyecto-Anndy_Rengifo.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/ANNDY JOSE RENGIFO LANDETA_10798325_assignsubmission_file_/Proyecto-Anndy_Rengifo.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/ANNDY JOSE RENGIFO LANDETA_10798325_assignsubmission_file_/Proyecto-Anndy_Rengifo.zip
AUBERTIN LEANDRO OCHOA VELEZ_10798343_assignsubmission_file_
PythonProjectExample.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/AUBERTIN LEANDRO OCHOA VELEZ_10798343_assignsubmission_file_/PythonProjectExample.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/AUBERTIN LEANDRO OCHOA VELEZ_10798343_assignsubmission_file_/PythonProjectExample.zip
BORIS GABRIEL GARCES PROAÑO_10798373_assignsubmission_file_
arqui.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/BORIS GABRIEL GARCES PROAÑO_10798373_assignsubmission_file_/arqui.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/BORIS GABRIEL GARCES PROAÑO_10798373_assignsubmission_file_/arqui.zip
BRYAN MAURICIO MORALES TITUAÑA_10798385_assignsubmission_file_
GitHub.txt
PythonProjectExample.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/BRYAN MAURICIO MORALES TITUAÑA_10798385_assignsubmission_file_/PythonProjectExample.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/BRYAN MAURICIO MORALES TITUAÑA_10798385_assignsubmission_file_/PythonProjectExample.zip
CESAR JOSUE ZAPATA CHILLA_10798361_assignsubmission_file_
PythonProjectZapata.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/CESAR JOSUE ZAPATA CHILLA_10798361_assignsubmission_file_/PythonProjectZapata.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/CESAR JOSUE ZAPATA CHILLA_10798361_assignsubmission_file_/PythonProjectZapata.zip
CHRISTOPHER ALEXANDER CRIOLLO PAREDES_10798397_assignsubmission_file_
PythonProjectoFigGeometricas_ChristopherCriollo.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/CHRISTOPHER ALEXANDER CRIOLLO PAREDES_10798397_assignsubmission_file_/PythonProjectoFigGeometricas_ChristopherCriollo.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/CHRISTOPHER ALEXANDER CRIOLLO PAREDES_10798397_assignsubmission_file_/PythonProjectoFigGeometricas_ChristopherCriollo.zip
DANIEL ISMAEL FLORES ESPIN_10798349_assignsubmission_file_
pythonProject.rar
DAVID ALEJANDRO PUGA NOVOA_10798367_assignsubmission_file_
PythonProjectExample_PugaDavid.rar
DAVID IGNACIO EGAS SOLIS_10798316_assignsubmission_file_
ScriptsPython_DavidEgas.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/DAVID IGNACIO EGAS SOLIS_10798316_assignsubmission_file_/ScriptsPython_DavidEgas.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/DAVID IGNACIO EGAS SOLIS_10798316_assignsubmission_file_/ScriptsPython_DavidEgas.zip
FRANCISCO ADRIAN CORREA ANRANGO_10798391_assignsubmission_file_
PythonProjectCorreaAdrian.rar
FREDDY ADHAYR JIMENEZ UNAUCHO_10798379_assignsubmission_file_
ProyectoPythonFreddyJimenez.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/FREDDY ADHAYR JIMENEZ UNAUCHO_10798379_assignsubmission_file_/ProyectoPythonFreddyJimenez.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/FREDDY ADHAYR JIMENEZ UNAUCHO_10798379_assignsubmission_file_/ProyectoPythonFreddyJimenez.zip
HODALYS ANAHI LOPEZ NUÑEZ_10798340_assignsubmission_file_
proyecto.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/HODALYS ANAHI LOPEZ NUÑEZ_10798340_assignsubmission_file_/proyecto.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/HODALYS ANAHI LOPEZ NUÑEZ_10798340_assignsubmission_file_/proyecto.zip
JOHANN VLADIMIR PASQUEL MONTENEGRO_10798310_assignsubmission_file_
FuncionesGeometríapy_PasquelJohann.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/JOHANN VLADIMIR PASQUEL MONTENEGRO_10798310_assignsubmission_file_/FuncionesGeometríapy_PasquelJohann.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/JOHANN VLADIMIR PASQUEL MONTENEGRO_10798310_assignsubmission_file_/FuncionesGeometríapy_PasquelJohann.zip
JONATHAN VICENTE PAREDES LEON_10798328_assignsubmission_file_
PythonProject_Jonathan Paredes.rar
JORGE ALEJANDRO TORRES MALDONADO_10798382_assignsubmission_file_
TorresJorge_PythonProject.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/JORGE ALEJANDRO TORRES MALDONADO_10798382_assignsubmission_file_/TorresJorge_PythonProject.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/JORGE ALEJANDRO TORRES MALDONADO_10798382_assignsubmission_file_/TorresJorge_PythonProject.zip
JORGE LUIS YANEZ SANDOVAL_10798394_assignsubmission_file_
Programacion Scripts.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/JORGE LUIS YANEZ SANDOVAL_10798394_assignsubmission_file_/Programacion Scripts.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/JORGE LUIS YANEZ SANDOVAL_10798394_assignsubmission_file_/Programacion Scripts.zip
JOSEPH ANDRES JIMENEZ ROMERO_10798388_assignsubmission_file_
PythonProjectGeometryV1.rar
LUIS ALEXANDER LEMA DELGADO_10798334_assignsubmission_file_
Captura de pantalla 2024-07-24 152516.png
PROYECTO LUIS LEMA.rar
LUIS ANGEL MOROCHO SALAZAR_10798358_assignsubmission_file_
PythonProjectExample-Luis-Morocho.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/LUIS ANGEL MOROCHO SALAZAR_10798358_assignsubmission_file_/PythonProjectExample-Luis-Morocho.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/LUIS ANGEL MOROCHO SALAZAR_10798358_assignsubmission_file_/PythonProjectExample-Luis-Morocho.zip
LUIS ENRIQUE PEREZ SEÑALIN_10798313_assignsubmission_file_
2.Programacion Script Python.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/LUIS ENRIQUE PEREZ SEÑALIN_10798313_assignsubmission_file_/2.Programacion Script Python.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/LUIS ENRIQUE PEREZ SEÑALIN_10798313_assignsubmission_file_/2.Programacion Script Python.zip
MARIA BELEN RAURA ANTE_10798331_assignsubmission_file_
PythonProjectExample.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/MARIA BELEN RAURA ANTE_10798331_assignsubmission_file_/PythonProjectExample.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/MARIA BELEN RAURA ANTE_10798331_assignsubmission_file_/PythonProjectExample.zip
MATEO MOISES MOLINA ESTRELLA_10798364_assignsubmission_file_
PythonProjectMateoMolina.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/MATEO MOISES MOLINA ESTRELLA_10798364_assignsubmission_file_/PythonProjectMateoMolina.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/MATEO MOISES MOLINA ESTRELLA_10798364_assignsubmission_file_/PythonProjectMateoMolina.zip
MOISES SANTIAGO PINEDA TORRES_10798322_assignsubmission_file_
Proyecto_Moisés_Pineda.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/MOISES SANTIAGO PINEDA TORRES_10798322_assignsubmission_file_/Proyecto_Moisés_Pineda.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/MOISES SANTIAGO PINEDA TORRES_10798322_assignsubmission_file_/Proyecto_Moisés_Pineda.zip
OLGUER MIJAEL MOLINA BALLADARES_10798352_assignsubmission_file_
proyecto.rar
SEBASTIAN ALEXANDER MORALES CEDEÑO_10798307_assignsubmission_file_
ProgramacionScriptsPython - Morales Sebastian.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/SEBASTIAN ALEXANDER MORALES CEDEÑO_10798307_assignsubmission_file_/ProgramacionScriptsPython - Morales Sebastian.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/SEBASTIAN ALEXANDER MORALES CEDEÑO_10798307_assignsubmission_file_/ProgramacionScriptsPython - Morales Sebastian.zip
SEBASTIAN ANDRES BRAVO QUINTEROS_10798355_assignsubmission_file_
proyecto.zip
/mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/SEBASTIAN ANDRES BRAVO QUINTEROS_10798355_assignsubmission_file_/proyecto.zip
Unzipped: /mnt/c/Users/entea/Downloads/CalificacionTrabajos/ProgramaciónScriptsPython/SEBASTIAN ANDRES BRAVO QUINTEROS_10798355_assignsubmission_file_/proyecto.zip
STIV STALYN QUISHPE CABEZAS_10798319_assignsubmission_file_
proyecto.rar
STIVEN ANDRES VISCAINO OCHOA_10798376_assignsubmission_file_
Funcionamiento_Script_ViscainoStiven.pdf
Proyecto_VS.rar
#+end_example




#+begin_src shell
pwd
#+end_src

#+RESULTS:
: /mnt/c/Users/entea/Lectures/iccd332ArqComp-2024-A/utils
